# Getting Started with pandas
### Imports

In [1]:
pip install -r requirements.txt

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in /home/jasenc/.local/lib/python3.8/site-packages (from -r requirements.txt (line 1)) (1.23.5)
Requirement already satisfied: pandas in /home/jasenc/.local/lib/python3.8/site-packages (from -r requirements.txt (line 2)) (1.5.2)
Requirement already satisfied: matplotlib in /home/jasenc/.local/lib/python3.8/site-packages (from -r requirements.txt (line 3)) (3.6.2)
Requirement already satisfied: matplotlib-inline in /home/jasenc/.local/lib/python3.8/site-packages (from -r requirements.txt (line 4)) (0.1.6)
Requirement already satisfied: python-dateutil>=2.8.1 in /home/jasenc/.local/lib/python3.8/site-packages (from pandas->-r requirements.txt (line 2)) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.8/dist-packages (from pandas->-r requirements.txt (line 2)) (2022.6)
Requirement already satisfied: fonttools>=4.22.0 in /home/jasenc/.local/lib/python3.8/site-packages (from matplotlib->-r requirements.txt (line 3)) (4.38.0)
Requirement already satisfied: pyparsing>=2.2.1 in /home/jasenc/.local/lib/python3.8/site-packages (from matplotlib->-r requirements.txt (line 3)) (3.0.9)
Requirement already satisfied: contourpy>=1.0.1 in /home/jasenc/.local/lib/python3.8/site-packages (from matplotlib->-r requirements.txt (line 3)) (1.0.6)
Requirement already satisfied: pillow>=6.2.0 in /home/jasenc/.local/lib/python3.8/site-packages (from matplotlib->-r requirements.txt (line 3)) (9.3.0)
Requirement already satisfied: kiwisolver>=1.0.1 in /home/jasenc/.local/lib/python3.8/site-packages (from matplotlib->-r requirements.txt (line 3)) (1.4.4)
Requirement already satisfied: cycler>=0.10 in /home/jasenc/.local/lib/python3.8/site-packages (from matplotlib->-r requirements.txt (line 3)) (0.11.0)
Requirement already satisfied: packaging>=20.0 in /home/jasenc/.local/lib/python3.8/site-packages (from matplotlib->-r requirements.txt (line 3)) (22.0)
Requirement already satisfied: traitlets in /home/jasenc/.local/lib/python3.8/site-packages (from matplotlib-inline->-r requirements.txt (line 4)) (5.7.1)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.8.1->pandas->-r requirements.txt (line 2)) (1.14.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import numpy as np
import pandas as pd

## it might be helpful to import
# from pandas import Series, DataFrame
## into local namespace for frequent use.

# Data Structures
## Series

Conviently packed with an index, also note the absence of the print function

In [3]:
obj.array

NameError: name 'obj' is not defined

Turn it into an array - typicall wrapping a NumPy array but can also contain special extension arrarys discussed later.

In [4]:
obj = pd.Series([4, 7, -5, 3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

The index to these objects is mutable, seen here:

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

Everything else seems to work as typical index keys..., logical statements for seleting keys with a value that meet a certain criteria. You can do basic math to objects.

In [8]:
obj *2

0     8
1    14
2   -10
3     6
dtype: int64

In [9]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Fixed length, ordered dictionary...

Passing through data.

In [10]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

obj3 = pd.Series(sdata)

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [11]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [12]:
states = ["California", "Ohio", "Oregon", "Texas"]

obj4= pd.Series(sdata, index = states)

obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Use `isna` and `notna` functions in pandas to detect missing data

In [13]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [14]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [15]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

#### Ok something really cool

pandas automatically aligns Series by index labl in arithmetic operations

In [16]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Think database `JOIN` operations

In [19]:
obj4.name = 'population'

obj4.index.name = 'state'

obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [20]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [21]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrames

The most common way to construct a DataFrame is from a dictionary of equal-length lists or NumPy arrays:

In [22]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [23]:
## Use the head() method to see the first five rows of large DataFrames
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [24]:
## Similar with tail
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

You can pass columns and data will be arranged in that order

In [25]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [26]:
frame2 = pd.DataFrame(data, columns = ["year", "state", "pop", "debt"])

frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [27]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [28]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

#### If you pass a key/column that doesn't exist NaN will be populated for that key/column

A column in a DataFrame can be retrived as a Series either by dicitionary0like-notiation or by using dot attribute notationm

In [29]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [30]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [31]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [32]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [33]:
frame2['debt'] = 16.5

In [34]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [36]:
frame2["debt"] = np.arange(6.)

In [37]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

the value’s length must match the length of the DataFrame

In [41]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
frame2['debt'] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

Delete keys/columns with `del`

Another common form of data is in nested dictionaries:

In [42]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},"Nevada": {2001: 2.4, 2002: 2.9}}

In [43]:
frame3 = pd.DataFrame(populations)

In [44]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [45]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

If a DataFrame's `index` and `columns` have their `name` set, they will be displayed. Unlike Series - DataFrames do not have a `name` attribute for the overall object.

## Index Data Structures

In [51]:
obj = pd.Series(np.arange(3), index=['a', 'b',  'c'])

index = obj.index

index

Index(['a', 'b', 'c'], dtype='object')

In [54]:
index[1:]

Index(['b', 'c'], dtype='object')

In [56]:
index[1] = "d"

TypeError: Index does not support mutable operations

Immutability makes it safer to share Index objects among data structures.

In [57]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [59]:
obj2 = pd.Series([1.5,-2.5,0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [60]:
obj2.index is labels

True

In [61]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [63]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object')

In [64]:
"Ohio" in frame3.columns

True

In [65]:
2003 in frame3.index

False

In [66]:
pd.Index(['foo', 'foo', 'bar', 'bar'])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# Essential Functionality